backend/artillery/load-test-massive.yml
config:
  target: 'http://localhost:3000'
  environments:
    default:
      variables:
        SENTRY_DNS: null
  phases:
    - duration: 300
      arrivalRate: 50
      name: 'High load - 50 requests per second for 5 minutes'
    - duration: 60
      arrivalRate: 1500
      name: 'Peak load - 1500 requests per second for 1 minute'
    - duration: 180
      arrivalRate: 500
      name: 'High load - 500 requests per second for 3 minutes'
    - duration: 60
      arrivalRate: 1
      name: 'Peak load - 1 requests per second for 1 minute'
    - duration: 600
      arrivalRate: 50000
      name: 'High load - 50000 requests per second for 10 minutes'
    - duration: 600
      arrivalRate: 1000000
      name: 'High load - 1M requests per second for 10 minutes'
    - duration: 60
      arrivalRate: 1
      name: 'Peak load - 1 requests per second for 1 minute'
    - duration: 600
      arrivalRate: 50000
      name: 'High load - 50000 requests per second for 10 minutes'
    - duration: 600
      arrivalRate: 1000000
      name: 'High load - 1M requests per second for 10 minutes'
    - duration: 300
      arrivalRate: 50
      name: 'High load - 50 requests per second for 5 minutes'
    - duration: 60
      arrivalRate: 1500
      name: 'Peak load - 1500 requests per second for 1 minute'
    - duration: 180
      arrivalRate: 500
      name: 'High load - 500 requests per second for 3 minutes'
    - duration: 300
      arrivalRate: 50
      name: 'High load - 50 requests per second for 5 minutes'
    - duration: 60
      arrivalRate: 1500
      name: 'Peak load - 1500 requests per second for 1 minute'
    - duration: 180
      arrivalRate: 500
      name: 'High load - 500 requests per second for 3 minutes'
    - duration: 60
      arrivalRate: 1
      name: 'Peak load - 1 requests per second for 1 minute'
    - duration: 600
      arrivalRate: 50000
      name: 'High load - 50000 requests per second for 10 minutes'
    - duration: 600
      arrivalRate: 1000000
      name: 'High load - 1M requests per second for 10 minutes'
    - duration: 180
      arrivalRate: 500
      name: 'High load - 500 requests per second for 3 minutes'
    - duration: 60
      arrivalRate: 1
      name: 'Peak load - 1 requests per second for 1 minute'
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - name: 'CRUD operations on test entity'
    weight: 7
    flow:
      - get:
          url: '/api/v1/health'
      - post:
          url: '/api/v1/test'
          json:
            name: 'Test Entity {{ $randomString() }}'
          capture:
            - json: '$._id'
              as: 'testId'
      - get:
          url: '/api/v1/test'
      - get:
          url: '/api/v1/test/{{ testId }}'
          ifTrue: 'testId'
      - put:
          url: '/api/v1/test/{{ testId }}'
          ifTrue: 'testId'
          json:
            _id: '{{ testId }}'
            name: 'Updated Entity {{ $randomString() }}'
      - delete:
          url: '/api/v1/test/{{ testId }}'
          ifTrue: 'testId'
  - name: 'Slow query test'
    weight: 3
    flow:
      - get:
          url: '/api/v1/test/slow?delay=3000'