backend/artillery/load-test-medium.yml
config:
  target: http://localhost:3000
  environments:
    default:
      variables:
        SENTRY_DNS: null
  phases:
    - duration: 120
      arrivalRate: 25
      name: Medium load - 25 requests per second for 2 minutes
  defaults:
    headers:
      Content-Type: application/json
scenarios:
  - name: Health and public endpoints
    weight: 20
    flow:
      - get:
          url: /api/v1/health

  - name: Authentication flow
    weight: 50
    flow:
      - post:
          url: /api/v1/auth/register
          json:
            email: user-{{ $randomString() }}@test.com
            password: Test123!@#
            passwordConfirm: Test123!@#
          capture:
            - json: $.user._id
              as: userId
      - post:
          url: /api/v1/auth/login
          json:
            email: user-{{ $randomString() }}@test.com
            password: Test123!@#
          capture:
            - json: $.accessToken
              as: accessToken
            - json: $.refreshToken
              as: refreshToken
      - get:
          url: /api/v1/users/me
          ifTrue: accessToken
          headers:
            Authorization: Bearer {{ accessToken }}
      - post:
          url: /api/v1/auth/refresh
          ifTrue: refreshToken
          json:
            refreshToken: { { refreshToken } }
          capture:
            - json: $.accessToken
              as: newAccessToken
      - post:
          url: /api/v1/auth/logout
          ifTrue: accessToken
          headers:
            Authorization: Bearer {{ accessToken }}
          json:
            refreshToken: { { refreshToken } }

  - name: CRUD operations on test entity
    weight: 30
    flow:
      - get:
          url: /api/v1/health
      - post:
          url: /api/v1/test
          json:
            name: Test Entity {{ $randomString() }}
          capture:
            - json: $._id
              as: testId
      - get:
          url: /api/v1/test
      - get:
          url: /api/v1/test/{{ testId }}
          ifTrue: testId
      - put:
          url: /api/v1/test/{{ testId }}
          ifTrue: testId
          json:
            _id: { { testId } }
            name: Updated Entity {{ $randomString() }}
      - delete:
          url: /api/v1/test/{{ testId }}
          ifTrue: testId